In [2]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[-0.85946035,  0.75795008, -0.29938344],
       [ 0.22068017, -0.35132166, -0.35544515],
       [-1.39897303,  0.41397007,  1.2190164 ],
       [ 0.21499312, -0.04294954, -0.11359052]])

In [5]:
df1 = pd.DataFrame(data, columns = list("ABC"))

In [6]:
df1

          A         B         C
0 -0.859460  0.757950 -0.299383
1  0.220680 -0.351322 -0.355445
2 -1.398973  0.413970  1.219016
3  0.214993 -0.042950 -0.113591

In [7]:
df2 = pd.DataFrame(np.random.randn(3,3), columns=list("ABC"))

In [8]:
df2

          A         B         C
0 -2.016515 -1.340906 -0.751858
1 -0.106443 -0.610955  0.066907
2 -0.077121 -0.387608  0.717087

In [9]:
df3 = pd.concat([df1, df2], axis=0)

In [10]:
df3

          A         B         C
0 -0.859460  0.757950 -0.299383
1  0.220680 -0.351322 -0.355445
2 -1.398973  0.413970  1.219016
3  0.214993 -0.042950 -0.113591
0 -2.016515 -1.340906 -0.751858
1 -0.106443 -0.610955  0.066907
2 -0.077121 -0.387608  0.717087

In [11]:
df3.index = range(7)

In [12]:
df3

          A         B         C
0 -0.859460  0.757950 -0.299383
1  0.220680 -0.351322 -0.355445
2 -1.398973  0.413970  1.219016
3  0.214993 -0.042950 -0.113591
4 -2.016515 -1.340906 -0.751858
5 -0.106443 -0.610955  0.066907
6 -0.077121 -0.387608  0.717087

In [13]:
df4 = pd.concat([df1, df2], axis=1)

In [14]:
df4

          A         B         C         A         B         C
0 -0.859460  0.757950 -0.299383 -2.016515 -1.340906 -0.751858
1  0.220680 -0.351322 -0.355445 -0.106443 -0.610955  0.066907
2 -1.398973  0.413970  1.219016 -0.077121 -0.387608  0.717087
3  0.214993 -0.042950 -0.113591       NaN       NaN       NaN